Управление_торговлей.ПБТ/src/Catalogs/ВидыСырья/ВидыСырья.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыСырья</name>
  <comment>Аналоги номенклатуры, являющейся сырьем</comment>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ОсновнойАналог</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ДСП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаСнабжения</name>
    <type>
      <types>CatalogRef.ГруппыСнабжения</types>
    </type>
  </attributes>
  <attributes>
    <name>Тара</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеНаАнглийском</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТП</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокПроверки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Неликвид</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВетСвидетельство</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕКод</name>
    <type>
      <types>CatalogRef.КлассификаторЕКодов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>АналогиСырья</name>
    <attributes>
      <name>Аналог</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>8</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Поставщики</name>
    <attributes>
      <name>Поставщик</name>
      <type>
        <types>CatalogRef.Партнеры</types>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Победитель</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>УИД</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>БазисыПоставки</name>
    <attributes>
      <name>УИД</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>БазисПоставки</name>
      <type>
        <types>CatalogRef.БазисПоставки</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВалютаПрочиеРасходы</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>ПрочиеРасходы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Управление_торговлей.ПБТ/src/Catalogs/ВидыСырья/Forms/ФормаЭлементаУправляемая/Module.bsl
&НаСервереБезКонтекста
Функция АналогИспользуетсяВДругихВидахСырья(ВидСырья, Аналог)

	//Если в качестве Аналога выбрна номенклатуры, которая уже является Аналогом в другом виде сырья, то сообщать об этом и не добавлять ее в текущий.
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВидыСырьяАналогиСырья.Ссылка,
	               |	ВидыСырьяАналогиСырья.Аналог
	               |ИЗ
	               |	Справочник.ВидыСырья.АналогиСырья КАК ВидыСырьяАналогиСырья
	               |ГДЕ
	               |	ВидыСырьяАналогиСырья.Аналог = &Аналог
	               |	И ВидыСырьяАналогиСырья.Ссылка <> &Ссылка";
	
	Запрос.УстановитьПараметр("Аналог", Аналог);
	Запрос.УстановитьПараметр("Ссылка", ВидСырья);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
	    ОбщегоНазначения.СообщитьПользователю("Аналог "+Выборка.Аналог+" уже используется в виде сырья "+ Выборка.Ссылка);
	КонецЦикла; 
	
КонецФункции

&НаКлиенте
Процедура АналогиСырьяАналогПриИзменении(Элемент)
	
	Аналог = Элементы.АналогиСырья.ТекущиеДанные.Аналог;
	АналогИспользуетсяВДругихВидахСырья(Объект.Ссылка, Аналог);
	
КонецПроцедуры
